In [ ]:
import pandas as pd
ship = pd.read_csv('http://bit.ly/kaggletrain')

In [ ]:
ship.head(5)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
ship.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
#Data filtering ==,!=, >= , <= ,>,<
#Categorical data encoding

#Count all the instance where condition satisfied
(ship['Survived'] == 1).sum()

342

In [ ]:
#Filter all the instance where condition satisfied
survived = ship[ship['Survived'] == 1]

In [ ]:
n_survived = ship[ship['Survived'] != 1]

In [ ]:
n_survived

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
4              5         0       3  ...   8.0500   NaN         S
5              6         0       3  ...   8.4583   NaN         Q
6              7         0       1  ...  51.8625   E46         S
7              8         0       3  ...  21.0750   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
888          889         0       3  ...  23.4500   NaN         S
890          891         0       3  ...   7.7500   NaN         Q

[549 rows x 12 columns]

In [ ]:
ship['Survived'].unique()

array([0, 1])

In [ ]:
#unique() - return the unique categorical value in a data series
ship['Pclass'].unique()

array([3, 1, 2])

In [ ]:
ship[ship['Pclass'] == 1]

     PassengerId  Survived  Pclass  ...     Fare        Cabin  Embarked
1              2         1       1  ...  71.2833          C85         C
3              4         1       1  ...  53.1000         C123         S
6              7         0       1  ...  51.8625          E46         S
11            12         1       1  ...  26.5500         C103         S
23            24         1       1  ...  35.5000           A6         S
..           ...       ...     ...  ...      ...          ...       ...
871          872         1       1  ...  52.5542          D35         S
872          873         0       1  ...   5.0000  B51 B53 B55         S
879          880         1       1  ...  83.1583          C50         C
887          888         1       1  ...  30.0000          B42         S
889          890         1       1  ...  30.0000         C148         C

[216 rows x 12 columns]

In [ ]:
#Filter all the paseengers from class 1 who couldn't survived
ship[(ship['Pclass'] == 3) & (ship['Survived'] == 0)]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
4              5         0       3  ...   8.0500   NaN         S
5              6         0       3  ...   8.4583   NaN         Q
7              8         0       3  ...  21.0750   NaN         S
12            13         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
882          883         0       3  ...  10.5167   NaN         S
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
888          889         0       3  ...  23.4500   NaN         S
890          891         0       3  ...   7.7500   NaN         Q

[372 rows x 12 columns]

In [ ]:
ship[(ship['Pclass'] == 2) | (ship['Pclass'] == 1)]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1              2         1       1  ...  71.2833   C85         C
3              4         1       1  ...  53.1000  C123         S
6              7         0       1  ...  51.8625   E46         S
9             10         1       2  ...  30.0708   NaN         C
11            12         1       1  ...  26.5500  C103         S
..           ...       ...     ...  ...      ...   ...       ...
880          881         1       2  ...  26.0000   NaN         S
883          884         0       2  ...  10.5000   NaN         S
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
889          890         1       1  ...  30.0000  C148         C

[400 rows x 12 columns]

In [ ]:
#or operation between 2 and 3
ship[ship['Pclass'].isin([2,3])]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
2              3         1       3  ...   7.9250   NaN         S
4              5         0       3  ...   8.0500   NaN         S
5              6         0       3  ...   8.4583   NaN         Q
7              8         0       3  ...  21.0750   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
888          889         0       3  ...  23.4500   NaN         S
890          891         0       3  ...   7.7500   NaN         Q

[675 rows x 12 columns]

In [ ]:
name = 'Braund, Mr. Owen Harris'
print(name.split(','))
print(name.split(',')[0])
print(name.split(',')[1])
print(name.split(',')[-1])

['Braund', ' Mr. Owen Harris']
Braund
 Mr. Owen Harris
 Mr. Owen Harris

In [ ]:
k = [3,5,6,7,8,9]
k[-2]

8

In [ ]:
querry = input(['Enter your name and Age using comma'])
if(int((querry.split(',')[-1])) > 18):
  print(querry.split(',')[0],'You can vote')
else:
  print(querry.split(',')[0],'You can not vote')

Enter your name and Age using commaBipul,55
Bipul You can vote

In [ ]:
ship['Name'].str.split(',')[10][0]

'Sandstrom'

In [ ]:
#Seperate surname from the names
surname=[]
for i in range(len(ship)):
  surname.append(ship['Name'].str.split(',')[i][0])

In [ ]:
ship.insert(4,'Surname',surname)

In [ ]:
ship.head(5)

   PassengerId  Survived  Pclass  ...     Fare Cabin Embarked
0            1         0       3  ...   7.2500   NaN        S
1            2         1       1  ...  71.2833   C85        C
2            3         1       3  ...   7.9250   NaN        S
3            4         1       1  ...  53.1000  C123        S
4            5         0       3  ...   8.0500   NaN        S

[5 rows x 13 columns]

In [ ]:
ship['Sex'].unique()

array(['male', 'female'], dtype=object)

In [ ]:
#map() - used to map a categorical string value into categorical numerical value
s_map = ship['Sex'].map({'male':0 , 'female':1})

In [ ]:
ship.insert(6,'mapped_gender',s_map)

In [ ]:
ship.head(5)

   PassengerId  Survived  Pclass  ...     Fare Cabin Embarked
0            1         0       3  ...   7.2500   NaN        S
1            2         1       1  ...  71.2833   C85        C
2            3         1       3  ...   7.9250   NaN        S
3            4         1       1  ...  53.1000  C123        S
4            5         0       3  ...   8.0500   NaN        S

[5 rows x 14 columns]

In [ ]:
(ship['Age'] == ship['Age'].min()).sum()

1

In [ ]:
#idxmin() - returns the location of minimum value
ship.loc[ship['Age'].idxmin()]['Name']

'Thomas, Master. Assad Alexander'

In [ ]:
(ship['Age'] == ship['Age'].max()).sum()

1

In [ ]:
#idxmax() - returns the location of maximum value
ship.loc[ship['Age'].idxmax()]['Name']

'Barkworth, Mr. Algernon Henry Wilson'

In [ ]:
ship[ship['Age'] == ship['Age'].max()]['Name']

630    Barkworth, Mr. Algernon Henry Wilson
Name: Name, dtype: object

In [ ]:
ship[ship['Pclass'] == 1]['Fare'].mean()

84.15468749999992

In [ ]:
ship[ship['Pclass'] == 2]['Fare'].mean()

20.66218315217391

In [ ]:
ship[ship['Pclass'] == 3]['Fare'].mean()

13.675550101832997

In [ ]:
#isnull() - will return true in case of null values
ship.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
ship[ship['Sex'] == 'male']['Age'].mean()

30.72664459161148

In [ ]:
round(ship[ship['Sex'] == 'male']['Age'].mean(),2)

30.73

In [ ]:
m = ship[ship['Sex'] == 'male']
m['Age'] = m['Age'].fillna(round(ship[ship['Sex'] == 'male']['Age'].mean(),2))

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [ ]:
m

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
4              5         0       3  ...   8.0500   NaN         S
5              6         0       3  ...   8.4583   NaN         Q
6              7         0       1  ...  51.8625   E46         S
7              8         0       3  ...  21.0750   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
883          884         0       2  ...  10.5000   NaN         S
884          885         0       3  ...   7.0500   NaN         S
886          887         0       2  ...  13.0000   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[577 rows x 12 columns]

In [ ]:
round(ship[ship['Sex'] == 'female']['Age'].mean(),2)

27.92

In [ ]:
f = ship[ship['Sex'] == 'female']
f['Age'] = f['Age'].fillna(round(ship[ship['Sex'] == 'female']['Age'].mean(),2))

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [ ]:
f

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
8              9         1       3  ...  11.1333   NaN         S
9             10         1       2  ...  30.0708   NaN         C
..           ...       ...     ...  ...      ...   ...       ...
880          881         1       2  ...  26.0000   NaN         S
882          883         0       3  ...  10.5167   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S

[314 rows x 12 columns]

In [ ]:
ship = m.append(f)

In [ ]:
ship.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
ship['Age'].mode()

0    24.0
dtype: float64

In [ ]:
ship['Age'] = ship['Age'].fillna(29.70)

In [ ]:
ship.shape

(891, 14)

In [ ]:
ship = ship.drop('Cabin',axis=1)

In [ ]:
ship['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [ ]:
K = pd.DataFrame({'a':[1,2,3] , 'b':[3,5,6]})
L = pd.DataFrame({'x':[6,7,8] , 'y':[4,6,7]})

In [ ]:
K

   a  b
0  1  3
1  2  5
2  3  6

In [ ]:
L

   a  b
0  6  4
1  7  6
2  8  7

In [ ]:
K.append(L).reset_index().drop('index',axis=1)

   a  b
0  1  3
1  2  5
2  3  6
3  6  4
4  7  6
5  8  7

In [ ]:
K.append(L)

     a    b    x    y
0  1.0  3.0  NaN  NaN
1  2.0  5.0  NaN  NaN
2  3.0  6.0  NaN  NaN
0  NaN  NaN  6.0  4.0
1  NaN  NaN  7.0  6.0
2  NaN  NaN  8.0  7.0

In [ ]:
ship['Cabin'].value_counts()

C23 C25 C27    4
G6             4
B96 B98        4
D              3
E101           3
              ..
C7             1
A31            1
A14            1
C103           1
D10 D12        1
Name: Cabin, Length: 147, dtype: int64

In [ ]:
ship = ship.drop('Cabin',axis=1)

In [ ]:
ship.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [ ]:
#isnull()
#fillna()
#dropna()
print(ship.shape)
ship = ship.dropna(axis=0)
print(ship.shape)

(891, 11)
(889, 11)

In [ ]:
print(ship.shape)
b = ship.dropna(axis=1)
print(b.shape)

(891, 11)
(891, 10)

In [ ]:
ship['Embarked']

0      S
4      S
5      Q
6      S
7      S
      ..
880    S
882    S
885    Q
887    S
888    S
Name: Embarked, Length: 889, dtype: object

In [ ]:
#get_dummies - to generate dummy value for categorical values
ship = pd.get_dummies(ship,columns=['Sex','Embarked'],drop_first=True)

In [ ]:
ship.head(5)

   PassengerId  Survived  Pclass  ... Sex_male  Embarked_Q  Embarked_S
0            1         0       3  ...        1           0           1
1            2         1       1  ...        0           0           0
2            3         1       3  ...        0           0           1
3            4         1       1  ...        0           0           1
4            5         0       3  ...        1           0           1

[5 rows x 13 columns]

In [ ]:
ship.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Sex_male         uint8
Embarked_Q       uint8
Embarked_S       uint8
dtype: object

1. Total no. of matches
2. Season with maximum no. of matches
3. Team who won maximum matches
4. Team won by maximum runs
5. Team won by maximum wickets
6. %ge of winner if they won toss as well
6. %ge of winner if they did batting first

In [ ]:
import pandas as pd
ipl = pd.read_csv('ipl_matches.csv')
ipl.head(5)

   id  season       city  ...         umpire1        umpire2 umpire3
0   1    2017  Hyderabad  ...     AY Dandekar       NJ Llong     NaN
1   2    2017       Pune  ...  A Nand Kishore         S Ravi     NaN
2   3    2017     Rajkot  ...     Nitin Menon      CK Nandan     NaN
3   4    2017     Indore  ...    AK Chaudhary  C Shamshuddin     NaN
4   5    2017  Bangalore  ...             NaN            NaN     NaN

[5 rows x 18 columns]

In [ ]:
#Total Matches
print(len(ipl))

756

In [ ]:
#To calculate repetations - value_counts()
#season with maximum no. of matches
ipl['season'].value_counts().idxmax()

2013

In [ ]:
ipl.loc[ipl['win_by_runs'].idxmax()]['winner']

'Mumbai Indians'

In [ ]:
ipl.loc[ipl['win_by_wickets'].idxmax()]['winner']

'Kolkata Knight Riders'

In [ ]:
ipl[ipl['win_by_wickets'] == ipl['win_by_wickets'].max()]['winner']

2            Kolkata Knight Riders
34                 Kings XI Punjab
71                 Deccan Chargers
119               Delhi Daredevils
183    Royal Challengers Bangalore
298               Rajasthan Royals
376                 Mumbai Indians
390            Chennai Super Kings
542    Royal Challengers Bangalore
590            Sunrisers Hyderabad
683    Royal Challengers Bangalore
Name: winner, dtype: object

In [ ]:
(ipl['winner'] == ipl['toss_winner']).sum()/len(ipl)

0.5198412698412699

In [ ]:
ipl['result'].value_counts()

normal       743
tie            9
no result      4
Name: result, dtype: int64

In [ ]:
ipl['winner'].value_counts().idxmax()

'Mumbai Indians'

In [ ]:
ipl[ipl['win_by_runs'] > 0]

        id  season  ...                umpire2        umpire3
0        1    2017  ...               NJ Llong            NaN
4        5    2017  ...                    NaN            NaN
8        9    2017  ...                 S Ravi            NaN
13      14    2017  ...               NJ Llong            NaN
14      15    2017  ...            Nitin Menon            NaN
..     ...     ...  ...                    ...            ...
741  11337    2019  ...  KN Ananthapadmanabhan  C Shamshuddin
742  11338    2019  ...            Nitin Menon  Anil Dandekar
743  11339    2019  ...               O Nandan  Nanda Kishore
745  11341    2019  ...            Nitin Menon      Ian Gould
755  11415    2019  ...              Ian Gould    Nigel Llong

[337 rows x 18 columns]

In [ ]:
(ipl['win_by_runs'] > 0).sum()/len(ipl)

0.44576719576719576

1. Movies with ratings more then 8.5 and from genre Comedy,Crime or Action and duration more then 160
2. Extract all the movies of actor 'Tim Robbins'
3. Highly rated movie of each genre

In [ ]:
imdb = pd.read_csv('http://bit.ly/imdbratings')

In [ ]:
imdb.head(5)

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

In [ ]:
imdb[(imdb['star_rating'] > 8.5) & (imdb['genre'].isin(['Crime','Action','Comedy'])) & (imdb['duration'] > 160)]

    star_rating  ...                                        actors_list
1           9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2           9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
36          8.6  ...     [u'Tom Hanks', u'Matt Damon', u'Tom Sizemore']

[3 rows x 6 columns]

In [ ]:
#.str.contains() - to check the existence of a string in a pandas series
imdb[imdb['actors_list'] == 'Tim Robbins']

Empty DataFrame
Columns: [star_rating, title, content_rating, genre, duration, actors_list]
Index: []

In [ ]:
imdb[imdb['actors_list'].str.contains('Tim Robbins')]

     star_rating  ...                                        actors_list
0            9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
365          8.0  ...     [u'Sean Penn', u'Tim Robbins', u'Kevin Bacon']
611          7.7  ...  [u'Andie MacDowell', u'Julianne Moore', u'Tim ...
693          7.7  ...   [u'Tim Robbins', u'Greta Scacchi', u'Fred Ward']
819          7.6  ...  [u'Tim Robbins', u'Elizabeth Pe\xf1a', u'Danny...

[5 rows x 6 columns]

In [ ]:
imdb.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [ ]:
best = []
for i in imdb['genre'].unique():
  print(imdb.loc[imdb[imdb['genre'] == str(i)]['star_rating'].idxmax()][['genre','title','star_rating']])
  best.append(imdb.loc[imdb[imdb['genre'] == str(i)]['star_rating'].idxmax()][['genre','title','star_rating']])

genre                             Crime
title          The Shawshank Redemption
star_rating                         9.3
Name: 0, dtype: object
genre                   Action
title          The Dark Knight
star_rating                  9
Name: 3, dtype: object
genre                 Drama
title          12 Angry Men
star_rating             8.9
Name: 5, dtype: object
genre                                 Western
title          The Good, the Bad and the Ugly
star_rating                               8.9
Name: 6, dtype: object
genre                                              Adventure
title          The Lord of the Rings: The Return of the King
star_rating                                              8.9
Name: 7, dtype: object
genre                 Biography
title          Schindler's List
star_rating                 8.9
Name: 8, dtype: object
genre                     Comedy
title          Life Is Beautiful
star_rating                  8.6
Name: 25, dtype: object
genre              Animation
title          Spirited Away
star_rating              8.6
Name: 30, dtype: object
genre              Mystery
title          Rear Window
star_rating            8.6
Name: 38, dtype: object
genre          Horror
title          Psycho
star_rating       8.6
Name: 39, dtype: object
genre              Film-Noir
title          The Third Man
star_rating              8.3
Name: 105, dtype: object
genre                Sci-Fi
title          Blade Runner
star_rating             8.2
Name: 145, dtype: object
genre                      History
title          Battleship Potemkin
star_rating                      8
Name: 338, dtype: object
genre                   Thriller
title          Shadow of a Doubt
star_rating                    8
Name: 350, dtype: object
genre                              Family
title          E.T. the Extra-Terrestrial
star_rating                           7.9
Name: 468, dtype: object
genre                            Fantasy
title          The City of Lost Children
star_rating                          7.7
Name: 638, dtype: object

In [ ]:
imdb.loc[imdb[imdb['genre'] == 'Comedy']['star_rating'].idxmax()]['title']

'Life Is Beautiful'

In [ ]:
imdb[imdb['genre'] == 'Comedy']['star_rating'].max()

8.6

In [ ]:
imdb[['title','genre']]

                                               title      genre
0                           The Shawshank Redemption      Crime
1                                      The Godfather      Crime
2                             The Godfather: Part II      Crime
3                                    The Dark Knight     Action
4                                       Pulp Fiction      Crime
..                                               ...        ...
974                                          Tootsie     Comedy
975                      Back to the Future Part III  Adventure
976  Master and Commander: The Far Side of the World     Action
977                                      Poltergeist     Horror
978                                      Wall Street      Crime

[979 rows x 2 columns]

In [ ]:
imdb.loc[:,['title','genre']]

                                               title      genre
0                           The Shawshank Redemption      Crime
1                                      The Godfather      Crime
2                             The Godfather: Part II      Crime
3                                    The Dark Knight     Action
4                                       Pulp Fiction      Crime
..                                               ...        ...
974                                          Tootsie     Comedy
975                      Back to the Future Part III  Adventure
976  Master and Commander: The Far Side of the World     Action
977                                      Poltergeist     Horror
978                                      Wall Street      Crime

[979 rows x 2 columns]

In [ ]:
import numpy as np
best_array = np.array(best)
best_movies = pd.DataFrame(best_array,columns=['Genre','Movie','Ratings'])

In [ ]:
best_movies.to_csv('best_movies.csv')

In [ ]:
best_movies

        Genre                                          Movie Ratings
0       Crime                       The Shawshank Redemption     9.3
1      Action                                The Dark Knight       9
2       Drama                                   12 Angry Men     8.9
3     Western                 The Good, the Bad and the Ugly     8.9
4   Adventure  The Lord of the Rings: The Return of the King     8.9
5   Biography                               Schindler's List     8.9
6      Comedy                              Life Is Beautiful     8.6
7   Animation                                  Spirited Away     8.6
8     Mystery                                    Rear Window     8.6
9      Horror                                         Psycho     8.6
10  Film-Noir                                  The Third Man     8.3
11     Sci-Fi                                   Blade Runner     8.2
12    History                            Battleship Potemkin       8
13   Thriller                              Shadow of a Doubt       8
14     Family                     E.T. the Extra-Terrestrial     7.9
15    Fantasy                      The City of Lost Children     7.7